; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v6 ?v13)
             (pred_4 ?v11 ?v1)
             (pred_1 ?v6 ?v1)
             (pred_9 ?v8 ?v6 )
	     (pred_11 ?v6)
             (pred_8 ?v10)
             (pred_5 ?v11)
             (pred_7 ?v1)
             (pred_12 ?v6)
             (pred_3 ?v11)
             (pred_2 ?v6)
             (pred_6 ))



(:action op_4
:parameters (?v9 ?v4 ?v7 ?v3)
:precondition (and (pred_8 ?v9) (pred_8 ?v4) (pred_5 ?v7) (pred_7 ?v3)
          (pred_10 ?v9 ?v4) (pred_4 ?v7 ?v3)
                   (pred_1 ?v4 ?v3) (pred_11 ?v9) 
                   (pred_12 ?v4) (pred_3 ?v7))
:effect (and  (pred_2 ?v4) (not (pred_12 ?v4))))


(:action op_3
:parameters (?v9 ?v12)
:precondition (and (pred_8 ?v9) (pred_8 ?v12)
               (pred_11 ?v9) (pred_10 ?v9 ?v12) (pred_2 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v9))))

(:action op_1
:parameters (?v9 ?v7)
:precondition (and (pred_8 ?v9) (pred_5 ?v7) 
                  (pred_11 ?v9) (pred_9 ?v7 ?v9) (pred_6 ))
:effect (and (pred_3 ?v7)
   (not (pred_9 ?v7 ?v9)) (not (pred_6 ))))


(:action op_2
:parameters (?v9 ?v2 ?v5)
:precondition (and (pred_8 ?v9) (pred_5 ?v2) (pred_5 ?v5)
                  (pred_11 ?v9) (pred_3 ?v5) (pred_9 ?v2 ?v9))
:effect (and (pred_3 ?v2) (pred_9 ?v5 ?v9)
        (not (pred_3 ?v5)) (not (pred_9 ?v2 ?v9))))

(:action op_5
:parameters (?v9 ?v7)
:precondition (and (pred_8 ?v9) (pred_5 ?v7) 
                  (pred_11 ?v9) (pred_3 ?v7))
:effect (and (pred_6 ) (pred_9 ?v7 ?v9) (not (pred_3 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_03 obj_04 obj_15 obj_08 obj_01 obj_14 obj_20 obj_09 obj_11 obj_18 obj_06 obj_19 obj_17 obj_13 obj_02
    obj_21 obj_05
    obj_12 obj_16 obj_10
    )

    (:init
       (pred_6)

       (pred_8 obj_07)
       (pred_8 obj_03)
       (pred_8 obj_04)
       (pred_8 obj_15)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_8 obj_14)
       (pred_8 obj_20)
       (pred_8 obj_09)
       (pred_8 obj_11)
       (pred_8 obj_18)
       (pred_8 obj_06)
       (pred_8 obj_19)
       (pred_8 obj_17)
       (pred_8 obj_13)
       (pred_8 obj_02)
       (pred_7 obj_21)
       (pred_7 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_16)
       (pred_5 obj_10)

       (pred_10 obj_07 obj_08)
       (pred_10 obj_07 obj_03)
       (pred_10 obj_03 obj_01)
       (pred_10 obj_03 obj_04)
       (pred_10 obj_03 obj_07)
       (pred_10 obj_04 obj_14)
       (pred_10 obj_04 obj_15)
       (pred_10 obj_04 obj_03)
       (pred_10 obj_15 obj_20)
       (pred_10 obj_15 obj_04)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_01 obj_11)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_01 obj_03)
       (pred_10 obj_01 obj_08)
       (pred_10 obj_14 obj_18)
       (pred_10 obj_14 obj_20)
       (pred_10 obj_14 obj_04)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_15)
       (pred_10 obj_20 obj_14)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_11 obj_17)
       (pred_10 obj_11 obj_18)
       (pred_10 obj_11 obj_01)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_18 obj_06)
       (pred_10 obj_18 obj_14)
       (pred_10 obj_18 obj_11)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_06 obj_18)
       (pred_10 obj_19 obj_17)
       (pred_10 obj_19 obj_09)
       (pred_10 obj_17 obj_13)
       (pred_10 obj_17 obj_11)
       (pred_10 obj_17 obj_19)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_17)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_02 obj_13)
       (pred_12 obj_15)
       (pred_12 obj_11)
       (pred_12 obj_06)
       (pred_1  obj_15 obj_21)
       (pred_1  obj_11 obj_05)
       (pred_1  obj_06 obj_05)
       (pred_2 obj_07)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_08)
       (pred_2 obj_01)
       (pred_2 obj_14)
       (pred_2 obj_20)
       (pred_2 obj_09)
       (pred_2 obj_18)
       (pred_2 obj_19)
       (pred_2 obj_17)
       (pred_2 obj_13)
       (pred_2 obj_02)

       (pred_4  obj_12 obj_21)
       (pred_4  obj_16 obj_05)
       (pred_4  obj_10 obj_05)
       (pred_9 obj_12 obj_17)
       (pred_9 obj_16 obj_03)
       (pred_9 obj_10 obj_08)
       (pred_11 obj_17)
    )

    (:goal (and
       (pred_9 obj_10 obj_11)
    ))
(:constraints
  (always (not (pred_11 obj_01)))
)
)

; plan
1. (op_3 obj_17 obj_19)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_19)
   goals met: 0 of 1
2. (op_3 obj_19 obj_09)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_09)
   goals met: 0 of 1
3. (op_3 obj_09 obj_08)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_08)
   goals met: 0 of 1
4. (op_1 obj_08 obj_10)
   deleted: (pred_9 obj_10 obj_08) (pred_6)
   added: (pred_3 obj_10)
   goals met: 0 of 1
5. (op_3 obj_08 obj_09)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_09)
   goals met: 0 of 1
6. (op_4 obj_09 obj_11 obj_10 obj_05)
   deleted: (pred_12 obj_11)
   added: (pred_2 obj_11)
   goals met: 0 of 1
7. (op_3 obj_09 obj_11)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_11)
   goals met: 0 of 1
8. (op_5 obj_11 obj_10)
   deleted: (pred_3 obj_10)
   added: (pred_6) (pred_9 obj_10 obj_11)
   goals met: 1 of 1
